---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsGlazingShaded
source: html/377c5e7c-edce-99fd-416a-25dcff31dddc.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsGlazingShaded Property

If this is true, glazing/windows that are auto-created on exterior walls will automatically
 have a shading device created on their top edge.

## Syntax (C#)
```csharp
public bool IsGlazingShaded { get; set; }
```